app/Controllers/Task.php

SELECT *
FROM `tasks`
WHERE `user_id` = '2'
---
    public function index()
    {
        if (!session()->has('logged_in')) {
            return redirect()->to('/login');
        }

        $tasks = $this->taskModel->where('user_id', session()->get('logged_in'))->findAll();

SELECT *
FROM `tasks`
WHERE `tasks`.`id` = '8'
---
    public function edit($id)
    {
        if (!session()->has('logged_in')) {
            return redirect()->to('/login');
        }

        $taskModel = new TaskModel();
        $task = $taskModel->find($id);

SELECT *
FROM `tasks`
WHERE `tasks`.`id` = '8'
UPDATE `tasks` SET `title` = 'thank you', `description` = 'hello world hello world', `status` = 'completed'
WHERE `tasks`.`id` IN ('8')
---
    public function update($id)
    {
        if (!session()->has('logged_in')) {
            return redirect()->to('/login');
        }

        $taskModel = new TaskModel();
        $task = $taskModel->find($id);

        if (!$task || $task['user_id'] != session()->get('logged_in')) {
            return redirect()->to('/tasks')->with('error', 'Task not found or unauthorized.');
        }

        $taskModel->update($id, [
            'title'       => $this->request->getPost('title'),
            'description' => $this->request->getPost('description'),
            'status'      => $this->request->getPost('status'),
        ]);